tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "shivammathur/php"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Python code formatter
brew "black", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Apache HTTP server
brew "httpd", restart_service: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# JSON enhanced with usability features
brew "json5"
# Library for manipulation of the macOS .icns resource format
brew "libicns"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# Rotates, compresses, and mails system logs
brew "logrotate", restart_service: true
# Platform built on V8 to build network applications
brew "node@14"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php@7.4", restart_service: true, link: true
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Ruby version manager
brew "rbenv"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Programmatically correct mistyped console commands
brew "thefuck"
# Process YAML documents from the CLI
brew "yq"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Menu Bar app to perform common Home Assistant functions
cask "ha-menu"
# Full TeX Live distribution with GUI applications
cask "mactex"
